{
    "aboutMe": {
        "menuItems": [
            {
                "key": 0,
                "icon": "Console"
            },
            {
                "key": 1,
                "icon": "MagicBall"
            },
            {
                "key": 2,
                "icon": "Gamepad"
            }
        ],
        "subMenuItems": [
            {
                "title": "professional-info",
                "items": [
                    "experience",
                    "hard-skills",
                    "soft-skills"
                ]
            },
            {
                "title": "personal-info",
                "items": [
                    "bio",
                    "interests",
                    "education"
                ]
            },
            {
                "title": "hobbies-info",
                "items": [
                    "board-games",
                    "computer-games"
                ]
            }
        ],
        "folderColors": [
            "#E99287",
            "#43D9AD",
            "#3A49A4"
        ],
        "contents": [
            [
                "Опыт разработки - 8 месяцев.\nПоследний разрабатываемый проект (май 2024 - н.в.) - сайт аспирантуры для Сибирского Федерального Университета.\nМоими обязанностями в процессе работы являются:\n\n- Разработка frontend части сайта аспирантуры, используя HTML, CSS, TypeScript, React, API, SCSS и другие современные веб-технологии.\n\n- Интеграция и взаимодействие с backend через RESTful API для реализации функциональности пользовательских интерфейсов.\n\n- Оптимизация производительности и обеспечение адаптивного дизайна веб-приложения.\n\nТакже проходил три летних практики в SibDev, студии веб-разработки и сопровождения.",
                "Мой стек технологий:\n- HTML, CSS (flex, grid)\n- JavaScript, TypeScript\n- React, Next.js\n- Redux, Redux-toolkit\n- React Hook Form, React Transition Group\n- SCSS, CSS Modules, CSS Frameworks (Tailwind CSS, Bootstrap, MUI и другие)\n- Git (GitHub, GitLab)\n- Webpack\n\nЕсть опыт интеграций с бэкендом через RESTful API, знаком с GraphQL.\nРеализую адаптивную верстку.",
                "- Тайм-менеджмент: Эффективно управляю временем и приоритетами, укладываясь в дедлайн.\n\n- Работа в команде: Имеется опыт сотрудничества в командах для достижения общих целей.\n\n- Коммуникации: Ясно выражаю мысли, умею слушать и понимать людей.\n\n- Решение проблем: Анализирую ситуации и нахожу оптимальные решения."
            ],
            [
                "Меня зовут Руслан, мне 21 год. Я всегда увлекался технологиями, их развитием и пользой для общества. С детства я много времени проводил за компьютером, играя в игры с друзьями, что в итоге привело меня к решению связать свою жизнь с IT. Мне нравится создавать что-то новое и уникальное, поэтому я выбрал программирование в качестве своей будущей специальности.\n\nЛичностные качества:\n- Спокоен и неконфликтен\n- Поддерживаю положительную атмосферу в коллективе\n- Терпелив и сохраняю концентрацию в стрессовых ситуациях\n- Стремлюсь доводить начатое до конца\n- Постоянно развиваюсь и открыт к новым знаниям",
                "Помимо разработки, я увлекаюсь в целом времяпрепровождением за компьютером: игры с друзьями, просмотр фильмов/сериалов/роликов, общение.\nТакже я люблю гулять и играть в интеллектуальные настольные игры.",
                "Окончил 11 классов в школе и, набрав 258 баллов ЕГЭ, стал студентом. В данный момент я обучаюсь на 4 курсе в Сибирском Федеральном Университете в Институте Космических и Информационных Технологий по направлению \"Прикладная Информатика\". Учусь хорошо и, если не смогу найти работу в течение года, планирую пойти в магистратуру."
            ],
            [
                "Мне нравятся настольные игры, как простые, так и сложные. Мне интересно изучать новые игры и совершенствоваться в старых, побеждать и получать удовольствие от процесса. Люблю игры с открытым соперничеством или с предателями, ведь так игра становится более напряжённой и интересной.\n\nИз последних купленных мною игр - \"Гномы-вредители\" и \"Взрывные котята\" - они понравились моим друзьям, и периодически мы в них играем.",
                "Моё увлечение с детства - компьютерные игры. Мне нравятся сетевые игры, ведь общение с живыми игроками гораздо интереснее.\n\nБольшую часть времени с друзьями в играх я провёл в Minecraft, также играл в различные онлайн-шутеры, такие как CS:GO и Valorant. Играл и в игры в жанре survival: Rust, DayZ. Недавно с подругой прошли Raft."
            ]
        ]
    },
    "projects": [
        {
            "title": "Аспирантура СФУ",
            "description": "Сайт аспирантуры Сибирского Федерального Университета (в разработке)",
            "img": "img/postgraduateSFU.png",
            "url": [
                {
                    "type": "video-demo",
                    "url": "https://vk.com/video398231397_456240322?list=ln-DygltDWYGVToZqSFpt"
                }
            ]
        },
        {
            "title": "Пусто",
            "description": "Пока пусто :(",
            "img": "img/nothing.jpg",
            "url": []
        },
        {
            "title": "Пусто",
            "description": "Пока пусто :(",
            "img": "img/nothing.jpg",
            "url": []
        },
        {
            "title": "Пусто",
            "description": "Пока пусто :(",
            "img": "img/nothing.jpg",
            "url": []
        },
        {
            "title": "Пусто",
            "description": "Пока пусто :(",
            "img": "img/nothing.jpg",
            "url": []
        },
        {
            "title": "Пусто",
            "description": "Пока пусто :(",
            "img": "img/nothing.jpg",
            "url": []
        }
    ]
}
